from django.shortcuts import render, redirect

# Create your views here.

books = [
    {
        "id" : 1, 
        "title" : "დედა ენა", 
        "author" : "იაკობ გოგებაშვილი", 
        "year" : 1876,
        "info" : "„დედა ენა“ ანუ „ანბანი და პირველი საკითხავი წიგნი სახალხო შკოლებისათვის“ — ქართული ენის ორიგინალური სახელმძღვანელო დაწყებითი სკოლებისათვის, შექმნილია იაკობ გოგებაშვილის მიერ. გამოიცა 1876 წელს. „დედა ენაში“ ორი წლის კურსის მასალაა. წერა-კითხვა ისწავლება ბგერითი ანალიზურ-სინთეზური მეთოდით. 1906 წლიდან „დედა ენა“ 2 წიგნად გამოიცა: პირველში მოთავსებულია წერა-კითხვის შესასწავლი მასალა, მეორეში — საყმაწვილო მხატვრული თხზულებები, ხალხური შემოქმედების ნიმუშები და საბუნებისმეტყველო, გეოგრაფიული, ისტორიული და ეთნოგრაფიული შინაარსის მეცნიერულ-პოპულარული სტატიები.",
        "img_link" : "https://lh6.googleusercontent.com/proxy/HRNd3auMCg6oCvckXD4A3PtFjpcsLVtOCF0IOQN15jZoKdSchrS_SQtMUP0Zm6CS-KgmP3ChL-8c3w"
    },
    {
        "id" : 2, 
        "title" : "კაცია-ადამიანი?",
        "author" : "ილია ჭავჭავაძე", 
        "year" : 1863,
        "info" : "კაცია-ადამიანი?! — ქართველი მწერლის ილია ჭავჭავაძის სატირული მოთხრობა თავად ლუარსაბ თათქარიძესა და მის ოჯახზე, რომელშიც გაშუქებულია მარადიული პრობლემა ადამიანის ცხოვრების არსისა. ერთი გამოგონილი პერსონაჟის მაგალითზე გაკრიტიკებულია ადამიანის ბიოლოგიური არსებობა. მოთხრობაში, ასევე, გაკრიტიკებული არიან იმდროინდელი ქართველები, როგორც თავად-აზნაურობა, ასევე გლეხები და მათი ზოგიერთი ჩვეულება.",
        "img_link" : "https://lh6.googleusercontent.com/proxy/y3Ds0RQqzd7QiPMpOP7P5WdekUoEdAu2QrqysXnALHR2CgAfqTYGs3L8i3wGfyBnhbRBFwCQ1l-kNA"
    },
    {
        "id" : 3, 
        "title" : "ვეფხისტყაოსანი",
        "author" : "შოთა რუსთაველი", 
        "year" : 1190,
        "info" : "ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან. შინაარსის მხრივ, ვეფხისტყაოსანი რთული ნაწარმოებია; აქ ორი პარალელური ამბავია მოთხრობილი — არაბეთისა და ინდოეთისა, თუმცა ორივე მათგანი ერთმანეთთან სიუჟეტურად დაკავშირებულია. პოემა მდიდარია პერსონაჟებით. დაწერილია შაირის სტილში, თექვსმეტმარცვლიანი საზომით.",
        "img_link" : "https://booksale.ge/uploads/books/1534937122.jpg"
    },
    {
        "id" : 4, 
        "title" : "დიდოსტატის მარჯვენა",
        "author" : "კონსტანტინე გამსახურდია", 
        "year" : 1939,
        "info" : "რომანს საფუძვლად უდევს სვეტიცხოვლის მშენებლობის ნახევრად ლეგენდური ისტორია. მთავარი მოქმედი პირები არიან მეფე გიორგი I და სვეტიცხოვლის ხუროთმოძღვარი კონსტანტინე არსაკიძე.„დიდოსტატის კონსტანტინეს მარჯვენა“ 1938–1939 წლებში დაიწერა. რომანის მოქმედება იშლება XI საუკუნის საქართველოში, უპირველესი ქრისტიანული ტაძრის - სვეტიცხოველის - გარშემო. რომანი ასევე არის 1937 წლის ტრაგედიის ალეგორიული გადატანა შორეულ წარსულში, კატასტროფულ მოვლენათა მარადიული მოდელის პოვნა და გამოხატვა, მისი წაკითხვა გარდასული ჟამის ფონზე, ხოლო ანტირუსული პათოსი დაიშიფრა ანტიბიზანტიური სულისკვეთებით.",
        "img_link" : "https://apiv1.biblusi.ge/storage/book/OsE65lBJ9gI06ma9y4fMGEpP1Ws89iGBUbdSvci3.jpg"
    },
    {
        "id" : 5, 
        "title" : "ტყეების მეფე",
        "author" : "დათო ტურაშვილი", 
        "year" : 2013,
        "info" : "“შენ ტყეთა მეფე ხარ და ვერა ოდეს გამოხვალ ველთა” – ასე სწერდნენ სელჩუკები ჯერ კიდევ გაპარტახებული საქართველოს მეფეს, დავით აღმაშენებელს, რომელსაც მამამისის, გიორგი II-ის მიერ ტახტის დათმობის შემდეგ ჭაბუკობაშივე მოუწია, თავის თავზე აეღო ძალიან რთული მისია – ტყე-ღრეებად ქცეული საქართველო კვლავ სახელმწიფოდ ექცია. ეს მატიანეში შემონახული ფაქტებია.",
        "img_link" : "https://sulakauri.b-cdn.net/wp-content/uploads/2020/02/tur-tqheebis-mephe.jpg"
    },
    {
        "id" : 6, 
        "title" : "კაცი, რომელსაც ლიტერატურა ძლიერ უყვარდა",
        "author" : "გურამ დოჩანაშვილი", 
        "year" : 1973,
        "info" : "ვასიკო კეჟერაძე ლიტერატურის სიყვარულის გზით წავიდა. კარგად იცოდა, რომ “იყო მკითხველი, ეს თავისთავად სასწაულია, მკითხველი – ეს სწორედ ისაა, ვისაც შეგიძლია ისედაც ვიწრო საძილე ტომარაში შეყვარებულებს შორის იწვე და სულაც არ იყო ზედმეტი, ეს – სასწაულია და მეტსაც გეტყვით, ზედმეტი კი არა, აუცილებელი ხარ, რადგან ავტორმა ასე ინება”. ამიტომაც პროფესიით ფოტოგრაფმა ატელიედან გასვლის გარეშე მოიარა მთელი მსოფლიო, გადახდა უამრავი თავგადასავალი, შეიყვარა უამრავი ქალი, მიაღწია პიროვნულ თავისუფლებას. ვასიკოსაც ჩხვლეტდა სიყვარულის კაქტუსი, ლიტერატურის სიყვარულისა.[1] სწორედ ამ დროს შეხვდა მასა ერთ-ერთი 'ჟურნალ-გაზეთის' კორესპონდენტი და დაიწყო ძალიან უცნაური ინტერვიუ.",
        "img_link" : "https://upload.wikimedia.org/wikipedia/ka/7/78/Kaci_litera.png"
    },
    {
        "id" : 7, 
        "title" : "სტუმარ-მასპინძელი",
        "author" : "ვაჟა-ფშაველა", 
        "year" : 1893,
        "info" : "სტუმარ-მასპინძელი — ქართველი პოეტის, ვაჟა-ფშაველას პოემა, რომელიც 1893 წელს დაწერა. პირველად გამოქვეყნდა გაზეთ „ივერიაში“ 1893 წელს (№ 146, 149, 152). ხელნაწერში სათაურად ჰქონდა „ზვიადაური“. პოემა მოგვითხრობს ხევსურებსა და ქისტებს შორის არსებულ შუღლზე. ვაჟა-ფშაველამ წერილში „ჩემი პოემების შესახებ“ „სტუმარ-მასპინძლის“ ხალხურ წარმომავლობაზე მიუთითა: „ზეპირგადმოცემამ მომცა მხოლოდ ერთი ადამიანის, ზვიადაურის სახელი და ერთი ეპიზოდი, სახელდობრ, ის, რომ მას ქისტები თავიანთი მკვდრის, დარლას საფლავზე ჰკლავენ, ხანჯალს ურჭობენ ნელ-ნელა ყელში და ცდილობენ, როგორმე შეაშინონ, მოდრიკონ, რომ მსხვერპლი მსხვერპლად გამოდგეს. ზვიადაური ქვავდება და გაიძახის: ძაღლ იყოს თქვენის მკვდრისადა! დანარჩენი პოემაში საკუთარი ფანტაზიის ნაყოფია“.",
        "img_link" : "https://www.artanuji.ge/img-site/upload/books/9237931463.jpg"
    },
    {
        "id" : 8, 
        "title" : "სიბრძნე-სიცრუისა",
        "author" : "სულხან-საბა ორბელიანი", 
        "year" : 1698,
        "info" : "წიგნი სიბრძნე სიცრუისა — სულხან-საბა ორბელიანის პირველი ლიტერატურული ქმნილება. იგი დაწერილია XVII საუკუნის ბოლო მეოთხედში. წიგნი ასევე ცნობილია სათაურით „სიბრძნე სიცრუისა“. უპირატესობა მიენიჭა პირველ სათაურს, როგორც ავტორისეულს. ეს დადასტურებულია XVII-XIX საუკუნეების ყველა ძირითადი ხელნაწერით. „სიბრძნე სიცრუის“ წიგნი სულხან–საბა ორბელიანს დაუწერია ახალგაზრდობაში. როგორც გვაუწყებს თხზულების ხელნაწერი „ჟამსა სიჭაბუკისასა“ (ყოველ შემთხვევაში, ბერად აღკვეცამდე, ანუ 1698 წლამდე) წიგნი შეიცავს იგავ–არაკების კრებულს, რომელიც წარმოდგენილია ფაბულური მოთხრობის ფონზე (მსგავსად ქილილა და დამანასი, სიბრძნე ბალავარისა და სხვ). არსებობს „სიბრძნე სიცრუისას“ რამდენიმე გამოცემა. 1959 წელს, გ. ლეონიძისა და ვ. დონდუას რედაქციით თბილისში დაიბეჭდა საიუბილეო გამოცემა. ",
        "img_link" : "https://apiv1.biblusi.ge/storage/book/aAOs4u9dA0GURpGyFsj2JrAlE6EwtOkRx1sDBUCq.jpg"
    }
]

def all_books(request):
    context = {"books" : books}
    return render(request, "books/index.html", context)

def book_info(request, id):
    book_detail_info = None
    
    for book in books:
        if book["id"] == id:
            book_detail_info = book
            break
            
    context = {"book" : book_detail_info}
    
    return render(request, "books/info.html", context)

def delete_book(request, id):
    
    for book in books:
        if book["id"] == id:
            book_to_delete = book
            break
            
    books.remove(book_to_delete)
    return redirect('index')