'''
დაწერეთ ფუნქცია, რომელიც უბრალოდ აბრუნებს არგუმენტად გადაწოდებულ რიცხვს, დაუწერეთ დეკორატორი, რომელიც 
შეამოწმებს, რომ რიცხვი უნდა იყოს დადებითი, თუ არის უარყოფითი ამ შემთხვევაში დააბრუნეთ ValueError შესაბამისი ტექსტით, 
სხვა შემთხვევაში აამოქმედეთ ფუნქცია, შედეგი კი დაბეჭდეთ დეკორატორიდან.

-----დაწერეთ დავალება ფუნქტორის გამოყენებით----
'''

class Myfunctor:
    def __init__(self, n):
        self.n = n
        
    def __call__(self):
        if self.n > 0:
            print(self.n)
        else:
            raise ValueError('Please, input positive number!')
        
myfunctor = Myfunctor(6)
myfunctor()
